src/test/resources/com/ingenico/direct/defaultimpl/createPayment.failure.rejected.json

{
    "errorId": "833dfd83-52ae-419c-b871-9df1278da93e",
    "errors": [
        {
            "code": "9002",
            "id": "MISSING_OR_INVALID_AUTHORIZATION",
            "message": "MISSING_OR_INVALID_AUTHORIZATION",
            "httpStatusCode": 402
        }
    ],
    "paymentResult": {
        "creationOutput": {
            "additionalReference": "1",
            "externalReference": "1"
        },
        "payment": {
            "id": "1_0",
            "paymentOutput": {
                "amountOfMoney": {
                    "amount": 2345,
                    "currencyCode": "EUR"
                },
                "references": {
                    "paymentReference": "0"
                },
                "paymentMethod": "card",
                "cardPaymentMethodSpecificOutput": {
                    "paymentProductId": 1
                }
            },
            "status": "REJECTED",
            "statusOutput": {
                "errors": [
                    {
                        "code": "9002",
                        "id": "MISSING_OR_INVALID_AUTHORIZATION",
                        "requestId": "24162",
                        "message": "MISSING_OR_INVALID_AUTHORIZATION",
                        "httpStatusCode": 402
                    }
                ],
                "isCancellable": false,
                "statusCategory": "UNSUCCESSFUL",
                "statusCode": 2,
                "statusCodeChangeDateTime": "20200101123030",
                "isAuthorized": false
            }
        }
    }
}