src/test/resources/com/ingenico/direct/defaultimpl/createPayment.json

{
    "creationOutput": {
        "additionalReference": "00000000010000000001",
        "externalReference": "000000000100000000010000100001"
    },
    "payment": {
        "id": "000000000100000000010000100001",
        "paymentOutput": {
            "amountOfMoney": {
                "amount": 2345,
                "currencyCode": "CAD"
            },
            "references": {
                "paymentReference": "0"
            },
            "paymentMethod": "card",
            "cardPaymentMethodSpecificOutput": {
                "paymentProductId": 1,
                "authorisationCode": "OK1131",
                "card": {
                    "cardNumber": "************3456",
                    "expiryDate": "1230"
                },
                "fraudResults": {
                    "fraudServiceResult": "error",
                    "avsResult": "X",
                    "cvvResult": "M"
                }
            }
        },
        "status": "PENDING_APPROVAL",
        "statusOutput": {
            "isCancellable": true,
            "statusCategory": "PENDING_MERCHANT",
            "statusCode": 600,
            "statusCodeChangeDateTime": "20200101123030",
            "isAuthorized": true
        }
    }
}