src/test/resources/com/onlinepayments/defaultimpl/createPayment.json

{
    "creationOutput": {
        "additionalReference": "1",
        "externalReference": "1"
    },
    "payment": {
        "id": "1_0",
        "paymentOutput": {
            "amountOfMoney": {
                "amount": 2345,
                "currencyCode": "EUR"
            },
            "references": {
                "paymentReference": "0"
            },
            "paymentMethod": "card",
            "cardPaymentMethodSpecificOutput": {
                "paymentProductId": 1,
                "authorisationCode": "OK1131",
                "card": {
                    "cardNumber": "1234567890123456",
                    "expiryDate": "1230"
                },
                "fraudResults": {
                    "fraudServiceResult": "error",
                    "avsResult": "X",
                    "cvvResult": "M"
                }
            }
        },
        "status": "PENDING_CAPTURE",
        "statusOutput": {
            "isCancellable": true,
            "statusCategory": "PENDING_MERCHANT",
            "statusCode": 5,
            "statusCodeChangeDateTime": "20200101123030",
            "isAuthorized": true
        }
    }
}